  
 
#Область ОбработчикиКомандФормы 

&НаКлиенте
Асинх Процедура ЗаполнитьДанные(Команда)
	
    ДлительнаяОперация = ВыполнитьВФонеНаСервере(); 
    
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполенияОбработки", ЭтотОбъект);
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция ВыполнитьВФонеНаСервере()
      
    ПараметрыВыполненияПроцедуры = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	
	ДанныеВыполнения = Новый Структура;
	ДанныеВыполнения.Вставить("Начало",    Период.ДатаНачала);
	ДанныеВыполнения.Вставить("Окончание", Период.ДатаОкончания);
	
    ПараметрыВыполнения = Новый Структура;
    ПараметрыВыполнения.Вставить("ИмяМетода", "ЗаполнитьРеализацииПоДоговорам");
    ПараметрыВыполнения.Вставить("ЭтоВнешняяОбработка", Ложь);   
    ПараметрыВыполнения.Вставить("ПараметрыВыполнения", ДанныеВыполнения); 
	
    Адрес = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
    
    Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполненияПроцедуры,"Обработка.ВКМ_МассовоеСозданиеАктов.МодульОбъекта.ЗаполнитьРеализацииПоДоговорам",ПараметрыВыполнения, Адрес); 
    
КонецФункции

&НаКлиенте
Процедура ПослеВыполенияОбработки(Результат, ДопПараметры) Экспорт
    
    Текст = "Завершено";
    
    Если Результат = Неопределено Тогда
        Текст = "Задание отменено";
    ИначеЕсли Результат.Статус = "Ошибка" Тогда
        Текст = "Выполение завершилось с ошибкой";
    ИначеЕсли Результат.Статус = "Выполнено" Тогда
        Текст = "Завершено успешно";
		ВКМ_ЗаполнитьРеализацииПоДоговорам();
    КонецЕсли;
    
    ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
    
КонецПроцедуры  

Процедура ВКМ_ЗаполнитьРеализацииПоДоговорам() 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор КАК ВКМ_Договор,
	|	СУММА(ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_СуммаОборот) КАК ВКМ_СуммаОборот
	|ПОМЕСТИТЬ ВТ_Задолженности
	|ИЗ
	|	РегистрНакопления.ВКМ_ЗадолженностиКлиентов.Обороты(&НП, &КП, , ) КАК ВКМ_ЗадолженностиКлиентовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженности.ВКМ_Договор КАК Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, НЕОПРЕДЕЛЕНО) КАК Реализация
	|ИЗ
	|	ВТ_Задолженности КАК ВТ_Задолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Задолженности.ВКМ_Договор = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Проведен)";
	
	Запрос.УстановитьПараметр("НП", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КП", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокДокументов.Загрузить(РезультатЗапроса.Выгрузить());
			
КонецПроцедуры

#КонецОбласти   

  
 