
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор, "ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, 
																				|ВКМ_ДатаОкончанияДействияДоговора, ВКМ_СтоимостьЧасаРаботы");
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ОбщегоНазначения.СообщитьПользователю("В документе указан договор с неверным типом!",,,,Отказ);	
	КонецЕсли;
	
	Если Дата < РеквизитыДоговора.ВКМ_ДатаНачалаДействияДоговора
		ИЛИ Дата >= РеквизитыДоговора.ВКМ_ДатаОкончанияДействияДоговора Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Договор просрочен!",,,,Отказ);
		
	КонецЕсли;
		
	// регистр ВКМ_ЗадолженностиКлиентов 
	Движения.ВКМ_ЗадолженностиКлиентов.Записывать = Истина;
	Для Каждого Стр Из ВКМ_ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ЗадолженностиКлиентов.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_КоличествоЧасов = Стр.ВКМ_ЧасыКОплате;
		Движение.ВКМ_Сумма = Стр.ВКМ_ЧасыКОплате * РеквизитыДоговора.ВКМ_СтоимостьЧасаРаботы;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 



#КонецЕсли
