#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРеализацииПоДоговорам(Параметры, АдресРезультата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор КАК ВКМ_Договор,
	|	СУММА(ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_СуммаОборот) КАК ВКМ_СуммаОборот
	|ПОМЕСТИТЬ ВТ_Задолженности
	|ИЗ
	|	РегистрНакопления.ВКМ_ЗадолженностиКлиентов.Обороты(&НП, &КП, , ) КАК ВКМ_ЗадолженностиКлиентовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженности.ВКМ_Договор КАК ВКМ_Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, НЕОПРЕДЕЛЕНО) КАК ДокументРеализации
	|ИЗ
	|	ВТ_Задолженности КАК ВТ_Задолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Задолженности.ВКМ_Договор = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Проведен)
	|ГДЕ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("НП", Параметры.ПараметрыВыполнения.Начало);
	Запрос.УстановитьПараметр("КП",Параметры.ПараметрыВыполнения.Окончание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ДокументРеализации = Выборка.ДокументРеализации;
		
		Если ДокументРеализации = Неопределено Тогда
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = Параметры.ПараметрыВыполнения.Окончание;
			ДокументОбъект.Организация =  ВКМ_ПолучитьОрганизацию(); 
			ДокументОбъект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ВКМ_Договор, "Владелец"); 
			ДокументОбъект.Договор = Выборка.ВКМ_Договор; 
			
			ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
			
			ДокументОбъект.ПроверитьЗаполнение();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла; 
			
КонецПроцедуры  

Функция ВКМ_ПолучитьОрганизацию() Экспорт
	
	Организации = Справочники.Организации.Выбрать();
	Пока Организации.Следующий() Цикл
		Возврат Организации.Ссылка;	
	КонецЦикла;
	
КонецФункции

#КонецОбласти



