 
 #Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ВКМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_УправлениеВидимостьюДоступностью();	
	
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиСобытийЭлементовФормы
 
 &НаКлиенте
 Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	 
	ВКМ_УправлениеВидимостьюДоступностью(); 
	
КонецПроцедуры
 
#КонецОбласти

 
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_УправлениеВидимостьюДоступностью()
	
	ДоговорАбоненскоеОбслуживание = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание;
	
	Элементы.ВКМ_ГруппаРеквизитыАбоненскоеОбслуживание.Видимость = ДоговорАбоненскоеОбслуживание;
	
КонецПроцедуры

#КонецОбласти
